In [1]:
# import dependencies
import pandas as pd
import pprint
import psycopg2
import matplotlib.pyplot as plt

%matplotlib inline

In [2]:
# SQLAlchemyfrom sqlalchemy import create_engine
from sqlalchemy import create_engine
engine = create_engine('postgresql+psycopg2://postgres:@localhost:5432/sql-challenge')
connection = engine.connect()

In [3]:
employees = pd.read_sql('select * from employees', connection, parse_dates=['birth_date','hire_date'])
employees.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [4]:
dept_manager = pd.read_sql('select * from dept_manager', connection)
dept_manager.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [5]:
salaries = pd.read_sql('select * from salaries', connection)
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228